Xorlent/ESP32AI/src/ESP32AI.cpp
/**
 * ESP32AI - AI-powered voice command library for ESP32
 * 
 * Copyright (c) 2026 Xorlent
 * Licensed under the MIT License.
 * https://github.com/Xorlent/ESP32AI
 * 
 * This library enables ESP32 devices to process voice commands using
 * Cloudflare WorkerAI and an I2S microphone
 * 
 */

#include "ESP32AI.h"
#include <WiFi.h>
#include <HTTPClient.h>
#include <WiFiClientSecure.h>

// NVS namespace for storing credentials
#define NVS_NAMESPACE "esp32ai"
#define NVS_DEVICEID "deviceid"
#define NVS_AUTH_KEY "auth"
#define NVS_ENDPOINT_KEY "endpoint"
#define NVS_SILENCE_THRESHOLD "silence"

/**
 * Constructor
 */
ESP32AI::ESP32AI(const char* deviceID, const char* authorization, const char* workerAIEndpoint) 
    : _i2sBckPin(-1), _i2sWsPin(-1), _i2sDataPin(-1), _i2sPort(I2S_NUM_0),
      _recordingPin(-1), _recordingActiveLow(false), _buttonWasPressed(false),
      _initialized(false), _i2sConfigured(false),
      _audioBuffer(nullptr), _audioBufferSize(0), _maxBufferSize(0),
      _multipartHeaderSpace(0), _audioDataOffset(0),
      _blockBuffer24(nullptr), _blockAbsValues(nullptr),
      _silenceThreshold(DEFAULT_SILENCE_THRESHOLD) {
    
    // If credentials provided, store them
    if (deviceID != nullptr) {
        _deviceID = String(deviceID);
    }
    if (authorization != nullptr) {
        _authorization = String(authorization);
    }
    if (workerAIEndpoint != nullptr) {
        String url = String(workerAIEndpoint);
        if (validateHttpsUrl(url)) {
            _workerAIEndpoint = normalizeEndpointUrl(url);
        } else {
            Serial.println("[ESP32AI] ERROR: Only HTTPS endpoints are allowed for security.");
            Serial.printf("[ESP32AI] Invalid URL: %s\n", workerAIEndpoint);
            _workerAIEndpoint = "";  // Clear invalid endpoint
        }
    }
}

/**
 * Destructor
 */
ESP32AI::~ESP32AI() {
    deinitializeI2S();
    if (_audioBuffer != nullptr) {
        free(_audioBuffer);
        _audioBuffer = nullptr;
    }
    if (_blockBuffer24 != nullptr) {
        free(_blockBuffer24);
        _blockBuffer24 = nullptr;
    }
    if (_blockAbsValues != nullptr) {
        free(_blockAbsValues);
        _blockAbsValues = nullptr;
    }
}

/**
 * Initialize the library
 */
bool ESP32AI::begin() {
    if (!initializeNVS()) {
        Serial.println("[ESP32AI] Failed to initialize ESP32AI.  Possible causes:");
        Serial.println("[ESP32AI]   - NVS (flash storage) initialization failed");
        Serial.println("[ESP32AI]   - Corrupted flash partition");
        Serial.println("[ESP32AI] Try erasing flash: Tools > Erase Flash > All Flash Contents");
        return false;
    }
    
    _initialized = true;
    Serial.println("[ESP32AI] Initialized successfully");
    
    // Check if credentials are configured
    bool needsSetup = (_deviceID.length() == 0 || 
                       _authorization.length() == 0 || 
                       _workerAIEndpoint.length() == 0);
    
    if (needsSetup) {
        Serial.println("[ESP32AI] ========================================");
        Serial.println("[ESP32AI] FIRST TIME SETUP REQUIRED");
        Serial.println("[ESP32AI] ========================================");
        Serial.println("[ESP32AI] No credentials found in NVS.");
        Serial.println("[ESP32AI] Starting interactive configuration...");
        Serial.println();
        
        // Automatically enter setup mode
        runSetup();
        
        Serial.println("[ESP32AI] Setup complete! Continuing initialization...");
    }
    
    return true;
}

/**
 * Initialize NVS and load/save credentials
 */
bool ESP32AI::initializeNVS() {
    if (!_preferences.begin(NVS_NAMESPACE, false)) {
        return false;
    }
    
    // If new credentials were provided, save them
    if (_deviceID.length() > 0) {
        _preferences.putString(NVS_DEVICEID, _deviceID);
        Serial.println("[ESP32AI] DeviceID saved to NVS");
    } else {
        // Load from NVS
        _deviceID = _preferences.getString(NVS_DEVICEID, "");
        if (_deviceID.length() == 0) {
            Serial.println("[ESP32AI] Warning: No DeviceID found in NVS");
        } else {
            Serial.println("[ESP32AI] DeviceID loaded from NVS");
        }
    }
    
    if (_authorization.length() > 0) {
        _preferences.putString(NVS_AUTH_KEY, _authorization);
        Serial.println("[ESP32AI] Authorization saved to NVS");
    } else {
        // Load from NVS
        _authorization = _preferences.getString(NVS_AUTH_KEY, "");
        if (_authorization.length() == 0) {
            Serial.println("[ESP32AI] Warning: No Authorization found in NVS");
        } else {
            Serial.println("[ESP32AI] Authorization loaded from NVS");
        }
    }
    
    // Save or load WorkerAI endpoint
    if (_workerAIEndpoint.length() > 0) {
        _preferences.putString(NVS_ENDPOINT_KEY, _workerAIEndpoint);
        Serial.println("[ESP32AI] Endpoint URL saved to NVS");
    } else {
        _workerAIEndpoint = _preferences.getString(NVS_ENDPOINT_KEY, "");
        if (_workerAIEndpoint.length() > 0) {
            // Validate loaded endpoint
            if (!validateHttpsUrl(_workerAIEndpoint)) {
                Serial.println("[ESP32AI] WARNING: Endpoint loaded from NVS is not HTTPS");
                Serial.printf("[ESP32AI] Invalid URL: %s\n", _workerAIEndpoint.c_str());
                _workerAIEndpoint = "";  // Clear invalid endpoint
            } else {
                Serial.println("[ESP32AI] Endpoint URL loaded from NVS");
            }
        }
    }
    
    // Load silence threshold from NVS (or use default if not calibrated)
    _silenceThreshold = _preferences.getInt(NVS_SILENCE_THRESHOLD, DEFAULT_SILENCE_THRESHOLD);
    if (_silenceThreshold != DEFAULT_SILENCE_THRESHOLD) {
        Serial.printf("[ESP32AI] Silence threshold loaded from NVS: %d\n", _silenceThreshold);
    }
    
    _preferences.end();
    return true;
}

/**
 * Set skills JSON configuration
 */
bool ESP32AI::setSkills(const char* skillsJson) {
    if (skillsJson == nullptr) {
        Serial.println("[ESP32AI] Error: Skills JSON is empty or null");
        return false;
    }
    
    // Prevent changing skills after they've been set
    if (_skillsJson.length() > 0) {
        Serial.println("[ESP32AI] Error: Skills already configured");
        Serial.println("[ESP32AI] Skills can only be set once during initialization");
        return false;
    }
    
    // Validate JSON
    JsonDocument doc;
    DeserializationError error = deserializeJson(doc, skillsJson);
    
    if (error) {
        Serial.println("[ESP32AI] Failed to set skills.");
        Serial.println("[ESP32AI] Check for missing or misplaced quotes, brackets, commas");
        Serial.print("[ESP32AI] JSON error details: ");
        Serial.println(error.c_str());
        Serial.println("[ESP32AI] Check the JSON format and try again.");
        return false;
    }
    
    // Store the skills JSON
    _skillsJson = String(skillsJson);
    
    Serial.println("[ESP32AI] Skills configured successfully");
    return true;
}

/**
 * Configure I2S pins
 */
void ESP32AI::configureI2S(int bckPin, int wsPin, int dataPin) {
    _i2sBckPin = bckPin;
    _i2sWsPin = wsPin;
    _i2sDataPin = dataPin;
    Serial.printf("[ESP32AI] I2S configured: BCK=%d, WS=%d, DATA=%d\n", bckPin, wsPin, dataPin);
}

/**
 * Configure recording trigger pin
 */
void ESP32AI::configureRecordingPin(int pin, bool activeLow) {
    _recordingPin = pin;
    _recordingActiveLow = activeLow;
    pinMode(_recordingPin, activeLow ? INPUT_PULLUP : INPUT);
    Serial.printf("[ESP32AI] Recording pin configured: GPIO%d (%s)\n", 
                  pin, activeLow ? "active low" : "active high");
    
    // System is ready for use
    Serial.println("\n=== Ready! Press and hold button to record ===");
    Serial.println("=== Send 'C' to calibrate silence threshold ===");
    Serial.print("=== Send 'S' to update configuration ===\n\n");
}

/**
 * Set WorkerAI endpoint URL
 */
void ESP32AI::setWorkerAIEndpoint(const char* url) {
    if (url != nullptr && strlen(url) > 0) {
        String urlStr = String(url);
        
        // Validate HTTPS
        if (!validateHttpsUrl(urlStr)) {
            Serial.println("[ESP32AI] ERROR: Only HTTPS endpoints are valid");
            Serial.printf("[ESP32AI] Invalid URL: %s\n", url);
            return;
        }
        
        // Normalize the URL to ensure it ends with /api/process
        _workerAIEndpoint = normalizeEndpointUrl(urlStr);
        
        // Save to NVS for persistence
        if (_preferences.begin(NVS_NAMESPACE, false)) {
            _preferences.putString(NVS_ENDPOINT_KEY, _workerAIEndpoint);
            _preferences.end();
            Serial.printf("[ESP32AI] WorkerAI endpoint set and saved to NVS: %s\n", _workerAIEndpoint.c_str());
        } else {
            Serial.printf("[ESP32AI] WorkerAI endpoint set: %s (NVS save failed)\n", _workerAIEndpoint.c_str());
        }
    }
}

/**
 * Set DeviceID and save to NVS
 */
bool ESP32AI::setDeviceID(const char* deviceID) {
    if (deviceID == nullptr || strlen(deviceID) == 0) {
        Serial.println("[ESP32AI] Error: DeviceID cannot be empty");
        return false;
    }
    
    // Free audio buffer if deviceID is changing (header space will be different)
    if (_audioBuffer != nullptr && _deviceID != String(deviceID)) {
        Serial.println("[ESP32AI] DeviceID changed, clearing audio buffer");
        freeAudioBuffer();
    }
    
    _deviceID = String(deviceID);
    
    // Save to NVS for persistence
    if (_preferences.begin(NVS_NAMESPACE, false)) {
        _preferences.putString(NVS_DEVICEID, _deviceID);
        _preferences.end();
        Serial.printf("[ESP32AI] DeviceID set and saved to NVS: %s\n", deviceID);
        return true;
    } else {
        Serial.println("[ESP32AI] Error: Failed to save DeviceID to NVS");
        return false;
    }
}

/**
 * Set Authorization token and save to NVS
 */
bool ESP32AI::setAuthorization(const char* authorization) {
    if (authorization == nullptr || strlen(authorization) == 0) {
        Serial.println("[ESP32AI] Error: Authorization token cannot be empty");
        return false;
    }
    
    _authorization = String(authorization);
    
    // Save to NVS for persistence
    if (_preferences.begin(NVS_NAMESPACE, false)) {
        _preferences.putString(NVS_AUTH_KEY, _authorization);
        _preferences.end();
        Serial.println("[ESP32AI] Authorization token set and saved to NVS");
        return true;
    } else {
        Serial.println("[ESP32AI] Error: Failed to save authorization token to NVS");
        return false;
    }
}

/**
 * Initialize I2S for recording
 */
bool ESP32AI::initializeI2S() {
    if (_i2sBckPin < 0 || _i2sWsPin < 0 || _i2sDataPin < 0) {
        Serial.println("[ESP32AI] Error: I2S pins not configured");
        return false;
    }
    
    if (_i2sConfigured) {
        return true; // Already configured
    }
    
    // Configuration tested with INMP441 microphone in I2S mode, 6k DMA buffer
    // 6 buffers × 1024 samples = 768ms buffering at 8kHz (50% safety margin)
    i2s_config_t i2s_config = {
        .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX),
        .sample_rate = DEFAULT_SAMPLE_RATE,
        .bits_per_sample = I2S_BITS_PER_SAMPLE_32BIT,
        .channel_format = I2S_CHANNEL_FMT_ONLY_LEFT,
        .communication_format = I2S_COMM_FORMAT_STAND_I2S,//I2S_COMM_FORMAT_I2S,
        .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
        .dma_buf_count = 6,
        .dma_buf_len = 1024,
        .use_apll = false,
        .tx_desc_auto_clear = false,
        .fixed_mclk = 0
    };
    
    i2s_pin_config_t pin_config = {
        .bck_io_num = _i2sBckPin,
        .ws_io_num = _i2sWsPin,
        .data_out_num = I2S_PIN_NO_CHANGE,
        .data_in_num = _i2sDataPin
    };
    
    esp_err_t err = i2s_driver_install(_i2sPort, &i2s_config, 0, NULL);
    if (err != ESP_OK) {
        Serial.printf("[ESP32AI] Error installing I2S driver: %d\n", err);
        return false;
    }
    
    err = i2s_set_pin(_i2sPort, &pin_config);
    if (err != ESP_OK) {
        Serial.printf("[ESP32AI] Error setting I2S pins: %d\n", err);
        i2s_driver_uninstall(_i2sPort);
        return false;
    }
    
