Xorlent/ESP32AI/src/ESP32AI.cpp
    _i2sConfigured = true;
    Serial.println("[ESP32AI] I2S initialized successfully");
    return true;
}

/**
 * Deinitialize I2S
 */
void ESP32AI::deinitializeI2S() {
    if (_i2sConfigured) {
        i2s_driver_uninstall(_i2sPort);
        _i2sConfigured = false;
        Serial.println("[ESP32AI] I2S deinitialized");
    }
}

/**
 * Start listening for voice commands
 */
bool ESP32AI::startListening() {
    if (!_initialized) {
        Serial.println("[ESP32AI] Error: Library not initialized. Call begin() first");
        return false;
    }
    
    if (_recordingPin < 0) {
        Serial.println("[ESP32AI] Error: Recording pin not configured");
        return false;
    }
    
    if (!initializeI2S()) {
        return false;
    }
    
    // Check if button is currently pressed (non-blocking)
    bool pinActive = _recordingActiveLow ? LOW : HIGH;
    bool buttonPressed = (digitalRead(_recordingPin) == pinActive);
    
    if (!buttonPressed) {
        // Button is released - update state and return
        if (_buttonWasPressed) {
            _buttonWasPressed = false;
            Serial.println("[ESP32AI] Button was released, ready to record");
        }
        return false;
    }
    
    // Button is pressed - check if this is a NEW press (transition from released to pressed)
    if (_buttonWasPressed) {
        // Button is still pressed from previous recording - ignore to prevent rapid re-recording
        // (Will be ready for new recording once button is released and pressed again)
        return false;
    }
    
    // This is a new button press - start recording
    _buttonWasPressed = true;  // Mark button as pressed to prevent re-trigger
    
    Serial.println("[ESP32AI] Recording started...");
    
    // Record audio
    bool success = recordAudio();
    
    if (success) {
        size_t audioDataSize = _audioBufferSize - _audioDataOffset;
        Serial.printf("[ESP32AI] Recording complete: %d bytes audio data\n", audioDataSize);
        
        // Keep button pressed state - next startListening() will wait for release before new recording
        // This prevents immediate re-recording if button is still held down
    } else {
        Serial.println("[ESP32AI] Recording failed");
        _buttonWasPressed = false;  // Reset state on failure
    }
    
    return success;
}

/**
 * Calibrate silence threshold by measuring ambient noise
 */
bool ESP32AI::calibrateSilenceThreshold(float multiplier) {
    if (!_initialized) {
        Serial.println("[ESP32AI] Error: Library not initialized. Call begin() first");
        return false;
    }
    
    if (!initializeI2S()) {
        return false;
    }
    
    // Free audio buffer to ensure sufficient memory for calibration
    // The buffer will be reallocated on next recording
    if (_audioBuffer != nullptr) {
        Serial.println("[ESP32AI] Freeing audio buffer for calibration");
        freeAudioBuffer();
    }
    
    Serial.println("[ESP32AI] ========================================");
    Serial.println("[ESP32AI]           SILENCE CALIBRATION");
    Serial.println("[ESP32AI] ========================================");
    Serial.println("[ESP32AI] Please remain QUIET for 3 seconds...");
    Serial.println();
    
    delay(1000);  // Give user time to read the message
    
    // Properly flush I2S DMA buffers to avoid stale/garbage data
    Serial.println("[ESP32AI] Clearing I2S buffers...");
    i2s_zero_dma_buffer(_i2sPort);
    delay(100);  // Allow DMA hardware to stabilize
    
    int32_t discardBuffer[256];
    size_t bytesRead = 0;
    for (int i = 0; i < 10; i++) {
        i2s_read(_i2sPort, discardBuffer, sizeof(discardBuffer), &bytesRead, pdMS_TO_TICKS(10));
    }
    Serial.println("[ESP32AI] I2S buffers cleared, starting calibration...");
    
    // Record 3 seconds of ambient noise
    const uint32_t calibrationDuration = 3000;  // 3 seconds
    const size_t samplesPerRead = 256;
    const size_t totalSamples = (DEFAULT_SAMPLE_RATE * calibrationDuration) / 1000;
    
    // Allocate temporary buffer for absolute values
    int32_t* absoluteValues = (int32_t*)malloc(totalSamples * sizeof(int32_t));
    if (absoluteValues == nullptr) {
        Serial.println("[ESP32AI] Error: Failed to allocate calibration buffer");
        return false;
    }
    
    size_t sampleCount = 0;
    unsigned long startTime = millis();
    int32_t i2s_buffer[samplesPerRead];
    
    // Collect absolute values of all samples
    while (sampleCount < totalSamples && (millis() - startTime) < calibrationDuration) {
        bytesRead = 0;
        size_t samplesToRead = min(samplesPerRead, totalSamples - sampleCount);
        
        // Use 100ms timeout instead of portMAX_DELAY
        esp_err_t result = i2s_read(_i2sPort, i2s_buffer, samplesToRead * sizeof(int32_t), 
                                    &bytesRead, pdMS_TO_TICKS(100));
        
        if (result == ESP_OK && bytesRead > 0) {
            size_t samplesRead = bytesRead / sizeof(int32_t);
            
            for (size_t i = 0; i < samplesRead && sampleCount < totalSamples; i++) {
                int32_t sample24 = i2s_buffer[i] >> 8;  // Get 24-bit value
                absoluteValues[sampleCount++] = abs(sample24);
            }
        }
    }
    
    if (sampleCount < totalSamples / 2) {
        Serial.println("[ESP32AI] Error: Insufficient calibration data collected");
        free(absoluteValues);
        return false;
    }
    
    // Verify proper microphone function by examining data variation
    int32_t minVal = absoluteValues[0];
    int32_t maxVal = absoluteValues[0];
    for (size_t i = 1; i < sampleCount; i++) {
        if (absoluteValues[i] < minVal) minVal = absoluteValues[i];
        if (absoluteValues[i] > maxVal) maxVal = absoluteValues[i];
    }
    
    // Check if datastream is empty
    if (maxVal == 0) {
        Serial.println("[ESP32AI] Error: No audio signal detected");
        Serial.println("[ESP32AI] 1. Microphone not connected");
        Serial.println("[ESP32AI] 2. Wrong I2S pins configured (is the L/R pin grounded?)");
        Serial.println("[ESP32AI] 3. Faulty hardware");
        free(absoluteValues);
        return false;
    }
    
