Xorlent/ESP32AI/src/ESP32AI.cpp
    // Check for insufficient variation (stuck/dead microphone)
    int32_t range = maxVal - minVal;
    if (range < 100) {  // Threshold for minimum expected variation (24-bit scale)
        Serial.println("[ESP32AI] Error: Insufficient audio variation detected");
        Serial.println("[ESP32AI] 1. Microphone not functioning");
        Serial.println("[ESP32AI] 2. Microphone input shorted/grounded");
        Serial.println("[ESP32AI] 3. Faulty hardware");
        free(absoluteValues);
        return false;
    }
    
    Serial.printf("[ESP32AI] Microphone check passed (variation range: %d)\n", range);
    
    // Calculate 85th percentile of ambient noise (more permissive than 95th for speech)
    int32_t noiseFloor = calculate85thPercentile(absoluteValues, sampleCount);
    free(absoluteValues);
    
    // Set threshold to multiplier × noise floor (provides safety margin)
    _silenceThreshold = noiseFloor * multiplier;
    
    // Save to NVS for persistence
    if (_preferences.begin(NVS_NAMESPACE, false)) {
        _preferences.putInt(NVS_SILENCE_THRESHOLD, _silenceThreshold);
        _preferences.end();
    }
    
    Serial.println();
    Serial.println("[ESP32AI] ========================================");
    Serial.println("[ESP32AI]          CALIBRATION COMPLETE");
    Serial.println("[ESP32AI] ========================================");
    Serial.printf("[ESP32AI] Noise floor (85th percentile): %d\n", noiseFloor);
    Serial.printf("[ESP32AI] Multiplier applied: %.1fx\n", multiplier);
    Serial.printf("[ESP32AI] Silence threshold set to: %d\n", _silenceThreshold);
    Serial.println("[ESP32AI] Threshold saved to NVS (persistent)");
    Serial.println("[ESP32AI] ========================================");
    Serial.println();
    
    return true;
}

/**
 * Helper function to read a line from Serial with timeout
 */
String ESP32AI::readSerialLine(unsigned long timeoutMs) {
    String input = "";
    unsigned long startTime = millis();
    
    // First, clear any leftover characters in the buffer
    delay(50);
    while (Serial.available()) {
        Serial.read();
    }
    
    while (millis() - startTime < timeoutMs) {
        if (Serial.available()) {
            char c = Serial.read();
            if (c == '\n') {
                // Newline received - return input (may be empty for default values)
                return input;
            } else if (c != '\r') {
                // Add character (ignore carriage returns)
                input += c;
            }
        }
        delay(10);
    }
    return input;
}

/**
 * Interactive setup routine - configure NVS settings
 */
void ESP32AI::runSetup() {
    Serial.println("\n========================================");
    Serial.println("       ESP32AI CONFIGURATION SETUP      ");
    Serial.println("========================================\n");
    
    // Clear serial buffer
    delay(50);
    while (Serial.available()) {
        Serial.read();
    }
    
    // Display current configuration
    Serial.println("Current Configuration:");
    Serial.println("---------------------");
    
    if (_deviceID.length() > 0) {
        Serial.printf("Device ID:      %s\n", _deviceID.c_str());
    } else {
        Serial.println("Device ID:      <not configured>");
    }
    
    if (_authorization.length() > 0) {
        Serial.println("Authorization:  <configured>");
    } else {
        Serial.println("Authorization:  <not configured>");
    }
    
    if (_workerAIEndpoint.length() > 0) {
        Serial.printf("Endpoint URL:   %s\n", _workerAIEndpoint.c_str());
    } else {
        Serial.println("Endpoint URL:   <not configured>");
    }
    
    Serial.println("\n---------------------");
    Serial.println("Enter new values or press ENTER to keep existing values.");
    Serial.println("Note: Fields without an existing value must be provided.\n");
    
    // Prompt for Device ID
    String newDeviceID = "";
    while (true) {
        if (_deviceID.length() > 0) {
            Serial.printf("Device ID [%s]: ", _deviceID.c_str());
        } else {
            Serial.print("Device ID (required): ");
        }
        
        newDeviceID = readSerialLine(30000);
        
        // If empty and we have a previous value, keep it
        if (newDeviceID.length() == 0 && _deviceID.length() > 0) {
            newDeviceID = _deviceID;
            Serial.println("  (Keeping existing value)");
            break;
        }
        
        // If empty and no previous value, re-prompt
        if (newDeviceID.length() == 0) {
            Serial.println("  Error: Device ID is required. Please enter a value.");
            continue;
        }
        
        // Valid input provided
        break;
    }
    
    // Prompt for Authorization Token
    String newAuthorization = "";
    bool hasAuth = _authorization.length() > 0;
    while (true) {
        if (hasAuth) {
            Serial.print("Authorization Token [<configured>]: ");
        } else {
            Serial.print("Authorization Token (required): ");
        }
        
        newAuthorization = readSerialLine(30000);
        
        // If empty and we have a previous value, skip updating
        if (newAuthorization.length() == 0 && hasAuth) {
            Serial.println("  (Keeping existing value)");
            newAuthorization = "";  // Skip update as though user hit ENTER without typing anything
            break;
        }
        
        // If empty and no previous value, re-prompt
        if (newAuthorization.length() == 0) {
            Serial.println("  Error: Authorization token is required. Please enter a value.");
            continue;
        }
        
        // Valid input provided
        break;
    }
    
    // Prompt for Endpoint URL
    String newEndpoint = "";
    while (true) {
        if (_workerAIEndpoint.length() > 0) {
            Serial.printf("Endpoint URL [%s]: ", _workerAIEndpoint.c_str());
        } else {
            Serial.print("Endpoint URL (required, must be HTTPS): ");
        }
        
        newEndpoint = readSerialLine(30000);
        
        // If empty and we have a previous value, keep it
        if (newEndpoint.length() == 0 && _workerAIEndpoint.length() > 0) {
            newEndpoint = _workerAIEndpoint;
            Serial.println("  (Keeping existing value)");
            break;
        }
        
        // If empty and no previous value, re-prompt
        if (newEndpoint.length() == 0) {
            Serial.println("  Error: Endpoint URL is required. Please enter a value.");
            continue;
        }
        
        // Validate HTTPS
        if (!newEndpoint.startsWith("https://")) {
            Serial.println("  Error: Endpoint must use HTTPS. Please enter a valid HTTPS URL.");
            continue;
        }
        
        // Valid input provided
        break;
    }
    
