Xorlent/ESP32AI/src/ESP32AI.cpp
    // Save the configuration
    Serial.println("\nSaving configuration to NVS...");
    
    bool success = true;
    
    if (newDeviceID != _deviceID) {
        if (!setDeviceID(newDeviceID.c_str())) {
            success = false;
        }
    }
    
    if (newAuthorization.length() > 0) {  // Only update if new value provided
        if (!setAuthorization(newAuthorization.c_str())) {
            success = false;
        }
    }
    
    if (newEndpoint != _workerAIEndpoint) {
        setWorkerAIEndpoint(newEndpoint.c_str());
    }
    
    Serial.println("\n========================================");
    if (success) {
        Serial.println("  Configuration saved successfully!");
    } else {
        Serial.println("  Configuration saved with errors.");
    }
    Serial.println("========================================\n");
}

/**
 * Calculate the space needed for multipart headers based on actual content sizes
 * This includes: boundaries, deviceID field, skills JSON field, audio field header, and WAV header
 */
size_t ESP32AI::calculateHeaderSpace() {
    size_t size = 0;
    
    // Boundary string is 25 characters (----ESP32AIBoundary12345)
    size_t boundaryLen = 25;
    
    // DeviceID field
    // --boundary\r\n
    size += 2 + boundaryLen + 2;
    // Content-Disposition: form-data; name="deviceId"\r\n\r\n
    size += 51;
    // Actual deviceID value
    size += _deviceID.length();
    // \r\n
    size += 2;
    
    // Skills JSON field  
    // --boundary\r\n
    size += 2 + boundaryLen + 2;
    // Content-Disposition: form-data; name="skills"\r\n
    size += 49;
    // Content-Type: application/json\r\n\r\n
    size += 32;
    // Actual skills JSON
    size += _skillsJson.length();
    // \r\n
    size += 2;
    
    // Audio field header
    // --boundary\r\n
    size += 2 + boundaryLen + 2;
    // Content-Disposition: form-data; name="audio"; filename="audio.wav"\r\n
    size += 71;
    // Content-Type: audio/wav\r\n\r\n
    size += 26;
    
    // WAV header (44 bytes)
    size += 44;
    
    // Safety margin
    size += 8;
    
    return size;
}

/**
 * Record audio from I2S microphone with per-block compression
 */
bool ESP32AI::recordAudio() {
    // Calculate audio data size for maximum recording time
    // Round up to next block boundary for clean alignment
    size_t samplesForDuration = (DEFAULT_SAMPLE_RATE * DEFAULT_CHANNELS * MAX_RECORD_TIME_MS) / 1000;
    size_t blocksNeeded = (samplesForDuration + COMPRESSION_BLOCK_SIZE - 1) / COMPRESSION_BLOCK_SIZE;
    size_t maxAudioDataSize = blocksNeeded * COMPRESSION_BLOCK_SIZE * (DEFAULT_BITS_PER_SAMPLE / 8);
    
    bool buffersAllocated = false;  // Track if we allocated this call
    
    // Calculate required buffer size including space for multipart headers and footer
    if (_audioBuffer == nullptr) {
        _multipartHeaderSpace = calculateHeaderSpace();
        _audioDataOffset = _multipartHeaderSpace;
        
        size_t multipartFooterSpace = 64;  // Space for closing boundary
        size_t requiredBufferSize = _multipartHeaderSpace + maxAudioDataSize + multipartFooterSpace;
        
        // Check available heap
        size_t freeHeap = ESP.getFreeHeap();
        if (requiredBufferSize > freeHeap / 2) {
            Serial.printf("[ESP32AI] Warning: Buffer size (%d bytes) may be tight. Free heap: %d bytes\n", 
                          requiredBufferSize, freeHeap);
        }
        
        _audioBuffer = (uint8_t*)malloc(requiredBufferSize);
        if (_audioBuffer == nullptr) {
            Serial.printf("[ESP32AI] Error: Failed to allocate audio buffer (%d bytes)\n", requiredBufferSize);
            Serial.printf("[ESP32AI] Free heap: %d bytes\n", ESP.getFreeHeap());
            _maxBufferSize = 0;
            _multipartHeaderSpace = 0;
            _audioDataOffset = 0;
            return false;
        }
        _maxBufferSize = requiredBufferSize;
        Serial.printf("[ESP32AI] Unified buffer allocated successfully, free heap: %d bytes\n", ESP.getFreeHeap());
        buffersAllocated = true;
    }
    
    // Allocate block processing buffers only if not allocated
    if (_blockBuffer24 == nullptr) {
        _blockBuffer24 = (int32_t*)malloc(COMPRESSION_BLOCK_SIZE * sizeof(int32_t));
        if (_blockBuffer24 == nullptr) {
            Serial.println("[ESP32AI] Error: Failed to allocate block processing buffer");
            return false;
        }
        buffersAllocated = true;
    }
    
    if (_blockAbsValues == nullptr) {
        _blockAbsValues = (int32_t*)malloc(COMPRESSION_BLOCK_SIZE * sizeof(int32_t));
        if (_blockAbsValues == nullptr) {
            Serial.println("[ESP32AI] Error: Failed to allocate absolute values buffer");
            return false;
        }
        buffersAllocated = true;
    }
    
    // Reset audio buffer position to just after header space (audio will be written here)
    _audioBufferSize = _audioDataOffset;
    unsigned long recordStart = millis();
    bool pinActive = _recordingActiveLow ? LOW : HIGH;
    
    Serial.printf("[ESP32AI] Using block-based compression (block size: %d samples)\n", COMPRESSION_BLOCK_SIZE);
    Serial.printf("[ESP32AI] Silence threshold: %d\n", _silenceThreshold);
    
    // Flush any stale data from I2S FIFO by reading and discarding
    int32_t discardBuffer[128];
    size_t bytesRead = 0;
    for (int i = 0; i < 5; i++) {
        i2s_read(_i2sPort, discardBuffer, sizeof(discardBuffer), &bytesRead, 10);
    }
    
    Serial.println("[ESP32AI] I2S buffers cleared, starting fresh recording...");
    
    size_t blockPosition = 0;  // Current position within the block
    int activeBlocks = 0;      // Count of blocks with actual audio (for statistics)
    int silentBlocks = 0;      // Count of silent blocks (for statistics)
    
    // Calculate maximum audio capacity (reserve footer space)
    // Footer needs: "\r\n--boundary--\r\n" = ~33 bytes, plus margin
    size_t footerReserve = 64;
    size_t maxAudioEnd = _maxBufferSize - footerReserve;
    
    // Record while pin is pressed and time limit not exceeded
    while ((millis() - recordStart) < MAX_RECORD_TIME_MS && _audioBufferSize < maxAudioEnd) {
        
        // Check button state with debounce for release detection
        if (digitalRead(_recordingPin) != pinActive) {
            // Button appears released - verify it's stable for 30ms to prevent bounce
            unsigned long debounceStart = millis();
            bool stableRelease = true;
            
            while (millis() - debounceStart < 30) {
                if (digitalRead(_recordingPin) == pinActive) {
                    // Button pressed again during debounce - false alarm, continue recording
                    stableRelease = false;
                    break;
                }
                delay(1);
            }
            
            if (stableRelease) {
                // Button truly released after debounce period
                // Process any remaining partial block (only occurs on early button release,
                // never at buffer capacity since buffer is block-aligned)
                if (blockPosition > 0) {
                    // Calculate 85th percentile for partial block
                    for (size_t i = 0; i < blockPosition; i++) {
                        _blockAbsValues[i] = abs(_blockBuffer24[i]);
                    }
                    int32_t blockLevel = calculate85thPercentile(_blockAbsValues, blockPosition);
                    // Note: _blockAbsValues is now modified by quickselect (no longer needed)
                    
                    // Check if this is a silent block
                    bool isSilent = blockLevel < _silenceThreshold;
                    
