Xorlent/ESP32AI/src/ESP32AI.cpp
                    if (isSilent) {
                        // Silent block - zero out all samples
                        for (size_t i = 0; i < blockPosition && _audioBufferSize < maxAudioEnd; i++) {
                            _audioBuffer[_audioBufferSize++] = 128;  // 128 = silence in unsigned 8-bit
                        }
                        silentBlocks++;
                    } else {
                        // Active audio block - compress and convert
                        int32_t gainDivisor = blockLevel / COMPRESSION_TARGET_LEVEL;
                        if (gainDivisor < 1) gainDivisor = 1;  // Prevent division issues
                        
                        for (size_t i = 0; i < blockPosition && _audioBufferSize < maxAudioEnd; i++) {
                            int32_t sample8 = _blockBuffer24[i] / gainDivisor;
                            
                            // Clamp to 8-bit signed range
                            if (sample8 > 127) sample8 = 127;
                            if (sample8 < -128) sample8 = -128;
                            
                            // Convert signed to unsigned 8-bit
                            _audioBuffer[_audioBufferSize++] = (uint8_t)(sample8 + 128);
                        }
                        activeBlocks++;
                    }
                }
                break;
            }
            // Otherwise continue recording (bounce detected and ignored)
        }
        
        // Process filled block before reading more samples
        if (blockPosition >= COMPRESSION_BLOCK_SIZE) {
            // Calculate absolute values for percentile calculation
            for (size_t j = 0; j < COMPRESSION_BLOCK_SIZE; j++) {
                _blockAbsValues[j] = abs(_blockBuffer24[j]);
            }
            
            // Calculate 85th percentile of this block
            int32_t blockLevel = calculate85thPercentile(_blockAbsValues, COMPRESSION_BLOCK_SIZE);
            
            // Check if this is a silent block
            bool isSilent = blockLevel < _silenceThreshold;
            
            if (isSilent) {
                // Silent block - zero out all samples
                for (size_t j = 0; j < COMPRESSION_BLOCK_SIZE && _audioBufferSize < maxAudioEnd; j++) {
                    _audioBuffer[_audioBufferSize++] = 128;
                }
                silentBlocks++;
            } else {
                // Active audio block - compress and convert
                int32_t gainDivisor = blockLevel / COMPRESSION_TARGET_LEVEL;
                if (gainDivisor < 1) gainDivisor = 1;
                
                for (size_t j = 0; j < COMPRESSION_BLOCK_SIZE && _audioBufferSize < maxAudioEnd; j++) {
                    int32_t sample8 = _blockBuffer24[j] / gainDivisor;
                    
                    // Clamp to 8-bit signed range
                    if (sample8 > 127) sample8 = 127;
                    if (sample8 < -128) sample8 = -128;
                    
                    // Convert signed to unsigned 8-bit
                    _audioBuffer[_audioBufferSize++] = (uint8_t)(sample8 + 128);
                }
                activeBlocks++;
            }
            
            blockPosition = 0;  // Reset for next block
        }
        
        // Read samples from INMP441 into block buffer
        int32_t i2s_buffer[256];
        bytesRead = 0;
        size_t samplesToRead = min((size_t)256, (size_t)(COMPRESSION_BLOCK_SIZE - blockPosition));
        
        // Use 100ms timeout instead of portMAX_DELAY to prevent hang on hardware failure
        esp_err_t result = i2s_read(_i2sPort, i2s_buffer, samplesToRead * sizeof(int32_t), 
                                    &bytesRead, pdMS_TO_TICKS(100));
        
        if (result == ESP_OK && bytesRead > 0) {
            size_t samplesRead = bytesRead / sizeof(int32_t);
            
            // Add samples to block buffer
            for (size_t i = 0; i < samplesRead; i++) {
                _blockBuffer24[blockPosition++] = i2s_buffer[i] >> 8;  // Convert to 24-bit
            }
        }
    }
    
    // Check if any audio was recorded
    size_t audioDataSize = _audioBufferSize - _audioDataOffset;
    if (audioDataSize == 0) {
        Serial.println("[ESP32AI] Warning: No audio data recorded");
        return false;
    }
    
    Serial.printf("[ESP32AI] Recording complete: %d bytes audio data\n", audioDataSize);
    Serial.printf("[ESP32AI] Active blocks: %d, Silent blocks: %d\n", activeBlocks, silentBlocks);
    Serial.printf("[ESP32AI] Free heap: %d bytes\n", ESP.getFreeHeap());
    
    // Check if we hit the maximum recording time limit
    if ((millis() - recordStart) >= MAX_RECORD_TIME_MS) {
        Serial.printf("[ESP32AI] Recording truncated at %d seconds\n", MAX_RECORD_TIME_MS / 1000);
    }
    
    return true;
}

/**
 * Process the recorded command
 */
SkillResponse ESP32AI::processCommand(uint32_t timeoutMs) {
    SkillResponse response;
    
    if (!_initialized) {
        Serial.println("[ESP32AI] Error: Library not initialized");
        return response;
    }
    
    if (_audioBuffer == nullptr || _audioBufferSize <= _audioDataOffset) {
        Serial.println("[ESP32AI] Error: No audio data to process");
        return response;
    }
    
    if (_workerAIEndpoint.length() == 0) {
        Serial.println("[ESP32AI] Error: WorkerAI endpoint not configured");
        return response;
    }
    
    Serial.println("[ESP32AI] Sending audio to WorkerAI...");
    
    String jsonResponse = sendToWorkerAI(timeoutMs);
    
    if (jsonResponse.length() > 0) {
        Serial.println("[ESP32AI] Response received, parsing...");
        response = parseResponse(jsonResponse);
    } else {
        Serial.println("[ESP32AI] Error: Empty response from WorkerAI");
    }
    
    return response;
}

/**
 * Send audio data to WorkerAI endpoint
 */
String ESP32AI::sendToWorkerAI(uint32_t timeoutMs) {
    HTTPClient http;
    WiFiClientSecure *secureClient = nullptr;
    String response;
    
