Xorlent/ESP32AI/src/ESP32AI.cpp
    // Check WiFi connection first
    if (WiFi.status() != WL_CONNECTED) {
        Serial.println("[ESP32AI] ERROR: WiFi not connected!");
        return "";
    }
    
    // Enforce HTTPS-only connections
    if (!validateHttpsUrl(_workerAIEndpoint)) {
        Serial.println("[ESP32AI] ERROR: Only HTTPS endpoints are allowed.");
        Serial.printf("[ESP32AI] Current endpoint: %s\n", _workerAIEndpoint.c_str());
        return "";
    }
    
    // Use WiFiClientSecure for HTTPS connections
    if (_workerAIEndpoint.startsWith("https://")) {
        secureClient = new WiFiClientSecure;
        if (secureClient) {
            // Configure SSL client for ESP32
            secureClient->setInsecure();  // Skip certificate verification
            
            // Set timeouts - be generous for SSL handshake
            secureClient->setTimeout(timeoutMs / 1000);  // Socket timeout in seconds
            
            // Set connection timeout for the initial TCP connection
            secureClient->setHandshakeTimeout(7);  // SSL handshake timeout in seconds
            
            // Connect with proper URL parsing
            if (!http.begin(*secureClient, _workerAIEndpoint)) {
                Serial.println("[ESP32AI] Failed HTTP connection");
                delete secureClient;
                return "";
            }
            http.setTimeout(timeoutMs);  // HTTP client timeout in milliseconds
            
            Serial.println("[ESP32AI] HTTPS client configured");
        } else {
            Serial.println("[ESP32AI] Failed to create WiFiClientSecure");
            return "";
        }
    } else {
        http.begin(_workerAIEndpoint);
        http.setTimeout(timeoutMs);  // Use provided timeout parameter
    }
    
    // Set headers
    if (_authorization.length() > 0) {
        http.addHeader("Authorization", _authorization);
    }
    
    // Create multipart boundary
    String boundary = "----ESP32AIBoundary" + String(random(10000, 99999));
    http.addHeader("Content-Type", "multipart/form-data; boundary=" + boundary);
    
    // Check available memory before creating request body
    size_t freeHeap = ESP.getFreeHeap();
    size_t audioDataSize = _audioBufferSize - _audioDataOffset;
    size_t estimatedBodySize = _maxBufferSize;  // Entire buffer will be used for multipart body
    size_t requiredHeap = estimatedBodySize + 32000;  // Add 32KB for SSL, HTTP processing, and buffers
    
    if (freeHeap < requiredHeap) {
        Serial.printf("[ESP32AI] ERROR: Insufficient memory.\n");
        Serial.printf("[ESP32AI]   Free heap: %d bytes\n", freeHeap);
        Serial.printf("[ESP32AI]   Required: ~%d bytes\n", requiredHeap);
        Serial.println("[ESP32AI]   1. Reduce MAX_RECORD_TIME_MS in ESP32AI.h");
        Serial.println("[ESP32AI]   2. Use lower sample rate");
        Serial.println("[ESP32AI]   3. Record shorter audio clips");
        
        if (secureClient) {
            delete secureClient;
        }
        http.end();
        return "";
    }
    
    // Prepare multipart body in the audio buffer
    size_t totalSize = prepareMultipartBuffer(boundary);
    
    if (totalSize == 0) {
        Serial.println("[ESP32AI] Error: Failed to prepare multipart buffer");
        if (secureClient) {
            delete secureClient;
        }
        http.end();
        return "";
    }
    
    Serial.printf("[ESP32AI] Sending request (%d bytes) with %dms timeout...\n", 
                  totalSize, timeoutMs);
    
    // Retry logic for ESP32 SSL connections (first attempt often fails)
    int httpResponseCode = -1;
    int maxRetries = 2;  // Try up to 3 times total (1 initial + 2 retries)
    
    for (int attempt = 0; attempt <= maxRetries; attempt++) {
        if (attempt > 0) {
            Serial.printf("[ESP32AI] Retry attempt %d/%d...\n", attempt, maxRetries);
            delay(500);  // Brief delay between retries
        }
        
        httpResponseCode = http.POST(_audioBuffer, totalSize);
        
        // If we got any response code other than connection failure, break
        if (httpResponseCode != HTTPC_ERROR_CONNECTION_REFUSED) {
            break;
        }
        
        // On connection failure, log and retry if we have attempts left
        if (attempt < maxRetries) {
            Serial.println("[ESP32AI] Connection failed, retrying...");
        }
    }
    
    if (httpResponseCode > 0) {
        // Get response body for both success and error cases
        response = http.getString();
        
        // Check for success status codes (200-299)
        if (httpResponseCode >= 200 && httpResponseCode < 300) {
            // Success - response already captured above
        } else {
            Serial.printf("[ESP32AI] Server error: %d\n", httpResponseCode);
            Serial.printf("[ESP32AI] Server response: %s\n", response.c_str());
            
            if (httpResponseCode == 401) {
                Serial.println("[ESP32AI] Authentication failed - check authorization token");
            } else if (httpResponseCode == 400) {
                Serial.println("[ESP32AI] Bad request - check audio format and form data");
            } else if (httpResponseCode == 500) {
                Serial.println("[ESP32AI] Server error - check Cloudflare Worker logs");
                Serial.println("  1. Whisper model failed to process audio format");
                Serial.println("  2. Invalid skills JSON structure");
                Serial.println("  3. Missing environment bindings (AI binding)");
            }
            
            // Return empty string to trigger error handling
            response = "";
        }
    } else {
        Serial.printf("[ESP32AI] HTTP Error code: %d\n", httpResponseCode);
        
        // Provide more specific error messages
        switch (httpResponseCode) {
            case HTTPC_ERROR_CONNECTION_REFUSED:  // -1
                Serial.println("[ESP32AI] Connection failed - possible SSL/TLS handshake error");
                Serial.println("  1. Check endpoint URL is correct");
                Serial.println("  2. Verify WiFi signal is strong");
                Serial.println("  3. Ensure sufficient free heap memory");
                break;
            case HTTPC_ERROR_SEND_HEADER_FAILED:  // -2
                Serial.println("[ESP32AI] Failed to send HTTP headers");
                break;
            case HTTPC_ERROR_SEND_PAYLOAD_FAILED:  // -3
                Serial.println("[ESP32AI] Failed to send HTTP payload");
                break;
            case HTTPC_ERROR_NOT_CONNECTED:  // -4
                Serial.println("[ESP32AI] Not connected to server");
                break;
            case HTTPC_ERROR_CONNECTION_LOST:  // -5
                Serial.println("[ESP32AI] Connection lost during transfer");
                break;
            case HTTPC_ERROR_NO_STREAM:  // -6
                Serial.println("[ESP32AI] No stream available");
                break;
            case HTTPC_ERROR_NO_HTTP_SERVER:  // -7
                Serial.println("[ESP32AI] No HTTP server");
                break;
            case HTTPC_ERROR_TOO_LESS_RAM:  // -8
                Serial.println("[ESP32AI] Too little RAM available");
                break;
            case HTTPC_ERROR_ENCODING:  // -9
                Serial.println("[ESP32AI] Transfer encoding error");
                break;
            case HTTPC_ERROR_STREAM_WRITE:  // -10
                Serial.println("[ESP32AI] Stream write error");
                break;
            case HTTPC_ERROR_READ_TIMEOUT:  // -11
                Serial.println("[ESP32AI] Read timeout");
                break;
            default:
                Serial.println("[ESP32AI] Check network connection and endpoint URL");
                break;
        }
    }
    
    http.end();
    
    // Clean up the secure client if it was created
    if (secureClient) {
        delete secureClient;
    }
    
    return response;
}

/**
 * Prepare multipart/form-data directly in the audio buffer
 * The audio data is already present at _audioDataOffset
 * This function builds headers at the start and footer at the end
 * Returns the total size of the multipart body
 */
size_t ESP32AI::prepareMultipartBuffer(const String& boundary) {
    size_t position = 0;
    
    // Helper lambda to write string to buffer
    auto writeString = [this, &position](const String& str) {
        for (size_t i = 0; i < str.length(); i++) {
            _audioBuffer[position++] = (uint8_t)str[i];
        }
    };
    
