Xorlent/ESP32AI/src/ESP32AI.cpp
    // Helper lambda to write C string to buffer
    auto writeCString = [this, &position](const char* str) {
        while (*str) {
            _audioBuffer[position++] = (uint8_t)*str++;
        }
    };
    
    // Build DeviceID field
    writeString("--");
    writeString(boundary);
    writeCString("\r\n");
    writeCString("Content-Disposition: form-data; name=\"deviceId\"\r\n\r\n");
    writeString(_deviceID);
    writeCString("\r\n");
    
    // Build Skills JSON field  
    writeString("--");
    writeString(boundary);
    writeCString("\r\n");
    writeCString("Content-Disposition: form-data; name=\"skills\"\r\n");
    writeCString("Content-Type: application/json\r\n\r\n");
    writeString(_skillsJson);
    writeCString("\r\n");
    
    // Build Audio field header
    writeString("--");
    writeString(boundary);
    writeCString("\r\n");
    writeCString("Content-Disposition: form-data; name=\"audio\"; filename=\"audio.wav\"\r\n");
    writeCString("Content-Type: audio/wav\r\n\r\n");
    
    // Insert WAV header (44 bytes) just before the audio data
    size_t audioDataSize = _audioBufferSize - _audioDataOffset;
    uint8_t wavHeader[44];
    createWavHeader(wavHeader, audioDataSize, DEFAULT_SAMPLE_RATE, DEFAULT_BITS_PER_SAMPLE, DEFAULT_CHANNELS);
    
    for (size_t i = 0; i < 44; i++) {
        _audioBuffer[position++] = wavHeader[i];
    }
    
    // Verify we didn't overwrite audio data
    if (position > _audioDataOffset) {
        Serial.printf("[ESP32AI] ERROR: Header overflow! Position: %d, AudioOffset: %d\n", 
                      position, _audioDataOffset);
        Serial.println("[ESP32AI] Header space calculation was incorrect!");
        return 0;
    }
    
    // Move position to end of audio data
    position = _audioBufferSize;
    
    // Add closing boundary (footer)
    writeCString("\r\n--");
    writeString(boundary);
    writeCString("--\r\n");
    
    // Verify we didn't exceed buffer size
    if (position > _maxBufferSize) {
        Serial.printf("[ESP32AI] ERROR: Buffer overflow! Position: %d, MaxBuffer: %d\n", 
                      position, _maxBufferSize);
        Serial.println("[ESP32AI] Footer space was insufficient!");
        return 0;
    }
    
    return position;  // Total size of multipart body
}


/**
 * Create WAV file header
 * Converts raw PCM data to WAV format for compatibility with Whisper
 */
void ESP32AI::createWavHeader(uint8_t* header, uint32_t dataSize, uint32_t sampleRate, 
                              uint16_t bitsPerSample, uint16_t channels) {
    uint32_t byteRate = sampleRate * channels * (bitsPerSample / 8);
    uint16_t blockAlign = channels * (bitsPerSample / 8);
    uint32_t chunkSize = 36 + dataSize;
    
    // RIFF header
    header[0] = 'R'; header[1] = 'I'; header[2] = 'F'; header[3] = 'F';
    header[4] = chunkSize & 0xFF;
    header[5] = (chunkSize >> 8) & 0xFF;
    header[6] = (chunkSize >> 16) & 0xFF;
    header[7] = (chunkSize >> 24) & 0xFF;
    
    // WAVE format
    header[8] = 'W'; header[9] = 'A'; header[10] = 'V'; header[11] = 'E';
    
    // fmt subchunk
    header[12] = 'f'; header[13] = 'm'; header[14] = 't'; header[15] = ' ';
    header[16] = 16; header[17] = 0; header[18] = 0; header[19] = 0;  // Subchunk1Size (16 for PCM)
    header[20] = 1; header[21] = 0;  // AudioFormat (1 for PCM)
    header[22] = channels & 0xFF; header[23] = (channels >> 8) & 0xFF;
    header[24] = sampleRate & 0xFF;
    header[25] = (sampleRate >> 8) & 0xFF;
    header[26] = (sampleRate >> 16) & 0xFF;
    header[27] = (sampleRate >> 24) & 0xFF;
    header[28] = byteRate & 0xFF;
    header[29] = (byteRate >> 8) & 0xFF;
    header[30] = (byteRate >> 16) & 0xFF;
    header[31] = (byteRate >> 24) & 0xFF;
    header[32] = blockAlign & 0xFF;
    header[33] = (blockAlign >> 8) & 0xFF;
    header[34] = bitsPerSample & 0xFF;
    header[35] = (bitsPerSample >> 8) & 0xFF;
    
    // data subchunk
    header[36] = 'd'; header[37] = 'a'; header[38] = 't'; header[39] = 'a';
    header[40] = dataSize & 0xFF;
    header[41] = (dataSize >> 8) & 0xFF;
    header[42] = (dataSize >> 16) & 0xFF;
    header[43] = (dataSize >> 24) & 0xFF;
}

/**
 * Parse WorkerAI JSON response
 */
SkillResponse ESP32AI::parseResponse(const String& jsonResponse) {
    SkillResponse response;
    
    // Validate response is not empty
    if (jsonResponse.length() == 0) {
        Serial.println("[ESP32AI] Error: Empty response from server");
        return response;
    }
    
    JsonDocument doc;
    DeserializationError error = deserializeJson(doc, jsonResponse);
    
    if (error) {
        Serial.print("[ESP32AI] Error parsing response JSON: ");
        Serial.println(error.c_str());
        Serial.print("[ESP32AI] Response was: ");
        Serial.println(jsonResponse.substring(0, 100)); // Print first 100 chars for debugging
        return response;
    }
    
    // Validate response is an array
    if (!doc.is<JsonArray>()) {
        Serial.println("[ESP32AI] Error: Response is not a JSON array");
        Serial.print("[ESP32AI] Response was: ");
        Serial.println(jsonResponse.substring(0, 100));
        return response;
    }
    
    // Parse response structure (expects array of functions with actions)
    JsonArray functions = doc.as<JsonArray>();
    
    // Check if array is empty
    if (functions.size() == 0) {
        Serial.println("[ESP32AI] Warning: Empty response array from server");
        return response;
    }
    
    for (JsonObject func : functions) {
        // Validate object has required fields
        if (!func.containsKey("Target") || !func.containsKey("Action")) {
            Serial.println("[ESP32AI] Warning: Response object missing Target or Action field");
            continue;
        }
        
        String targetName = func["Target"] | "";
        String actionName = func["Action"] | "";
        
        // Validate field values
        if (targetName.length() == 0) {
            Serial.println("[ESP32AI] Warning: Empty Target name in response");
            continue;
        }
        
        // Check if this function has a non-empty action
        if (actionName.length() > 0 && 
            actionName != "None" && 
            actionName != "null" && 
            actionName != "NULL") {
            
            response.hasAction = true;
            response.targetName = targetName;
            response.actionName = actionName;
            
            // Check for action value (for integer types, etc.)
            if (func.containsKey("Value")) {
                response.actionValue = func["Value"].as<String>();
            }
            
            Serial.printf("[ESP32AI] Action detected: %s -> %s", 
                         targetName.c_str(), actionName.c_str());
            if (response.actionValue.length() > 0) {
                Serial.printf(" = %s", response.actionValue.c_str());
            }
            Serial.println();
            
            break; // Only one action per request
        }
    }
    
    if (!response.hasAction) {
        Serial.println("[ESP32AI] No action detected in response");
    }
    
    return response;
}

/**
 * Calculate 85th percentile of an array of values (for silence detection and compression)
 * Uses in-place quickselect algorithm - O(n) average time, no malloc needed
 * More permissive than 95th percentile - better for preserving speech with natural pauses
 * WARNING: This function modifies the input array (partial sorting)
 */
int32_t ESP32AI::calculate85thPercentile(int32_t* values, size_t count) {
    if (count == 0) {
        return 0;
    }
    
    if (count == 1) {
        return values[0];
    }
    
