Xorlent/ESP32AI/src/ESP32AI.cpp
    // Calculate target index for 85th percentile (more permissive than 95th for speech detection)
    size_t targetIndex = (size_t)((count - 1) * 0.85);
    
    // Use quickselect to find the element at targetIndex position
    // This partitions the array so that values[targetIndex] contains the 85th percentile
    int left = 0;
    int right = count - 1;
    
    while (left < right) {
        // Partition using median-of-three for better pivot selection
        int mid = left + (right - left) / 2;
        
        // Ensure values[mid] <= values[left] <= values[right]
        if (values[mid] > values[left]) {
            int32_t temp = values[mid];
            values[mid] = values[left];
            values[left] = temp;
        }
        if (values[right] > values[left]) {
            int32_t temp = values[right];
            values[right] = values[left];
            values[left] = temp;
        }
        if (values[right] > values[mid]) {
            int32_t temp = values[right];
            values[right] = values[mid];
            values[mid] = temp;
        }
        
        // Use middle element as pivot
        int32_t pivot = values[mid];
        
        // Move pivot to end
        int32_t temp = values[mid];
        values[mid] = values[right - 1];
        values[right - 1] = temp;
        
        // Partition
        int i = left;
        int j = right - 1;
        
        while (true) {
            while (i < right && values[++i] < pivot) {}
            while (j > left && values[--j] > pivot) {}
            
            if (i >= j) {
                break;
            }
            
            // Swap
            temp = values[i];
            values[i] = values[j];
            values[j] = temp;
        }
        
        // Restore pivot
        temp = values[i];
        values[i] = values[right - 1];
        values[right - 1] = temp;
        
        // Determine which partition to continue with
        if (i == targetIndex) {
            return values[i];
        } else if (i > targetIndex) {
            right = i - 1;
        } else {
            left = i + 1;
        }
    }
    
    return values[targetIndex];
}

/**
 * Validate that a URL uses HTTPS protocol
 */
bool ESP32AI::validateHttpsUrl(const String& url) {
    if (url.length() == 0) {
        return false;
    }
    
    // Check if URL starts with https://
    if (!url.startsWith("https://")) {
        return false;
    }
    
    // Additional basic validation - ensure there's a domain after https://
    if (url.length() <= 8) {  // "https://" is 8 characters
        return false;
    }
    
    return true;
}

/**
 * Free audio buffer and reset all related state variables
 * Call this when the buffer needs to be reallocated (e.g., config changes)
 */
void ESP32AI::freeAudioBuffer() {
    if (_audioBuffer != nullptr) {
        free(_audioBuffer);
        _audioBuffer = nullptr;
    }
    _maxBufferSize = 0;
    _multipartHeaderSpace = 0;
    _audioDataOffset = 0;
    _audioBufferSize = 0;
}

/**
 * Normalize endpoint URL by ensuring it ends with /api/process
 * Handles cases where user omits the api route or adds extra content after it
 */
String ESP32AI::normalizeEndpointUrl(const String& url) {
    String normalized = url;
    
    // Remove trailing slashes
    while (normalized.endsWith("/")) {
        normalized = normalized.substring(0, normalized.length() - 1);
    }
    
    // Check if /api/process is already in the URL
    int processIndex = normalized.indexOf("/api/process");
    
    if (processIndex >= 0) {
        // Found /api/process - truncate everything after it
        normalized = normalized.substring(0, processIndex + 12);  // 12 = length of "/api/process"
        Serial.println("[ESP32AI] URL already contains /api/process, normalized to: " + normalized);
    } else {
        // /api/process not found - append it
        normalized += "/api/process";
        Serial.println("[ESP32AI] Appended /api/process to URL: " + normalized);
    }
    
    return normalized;
}
